{
  "metadata": {
    "source": "ServiceNow Export",
    "extraction_date": "2025-10-14",
    "total_tickets_in_period": 156,
    "exported_tickets": 12,
    "export_filter": "Category = Loan_Origination AND Priority IN (P1, P2)",
    "date_range": "2024-07-01 to 2025-06-30"
  },
  "tickets": [
    {
      "ticket_id": "INC-2024-04218",
      "created": "2024-08-14T09:22:00",
      "resolved": "2024-08-14T16:45:00",
      "priority": "P1",
      "category": "System_Outage",
      "subcategory": "LOS",
      "summary": "Encompass system unavailable - cannot process loan applications",
      "description": "Encompass LOS is down for all users since 8:45 AM. Cannot access pipeline, run AUS, or generate disclosures. ICE (vendor) has been contacted. 47 loans in active pipeline affected.",
      "assigned_to": "IT.ServiceDesk",
      "escalated_to": "IT.Director",
      "impacted_loans": 47,
      "resolution": "ICE confirmed server maintenance overrun. System restored at 4:15 PM. All pending TRID deadlines reviewed; 3 LEs at risk of tolerance violation - rush processed upon restoration.",
      "root_cause": "Vendor scheduled maintenance extended beyond window without notification",
      "sla_met": false,
      "resolution_hours": 7.4
    },
    {
      "ticket_id": "INC-2024-04392",
      "created": "2024-08-28T11:30:00",
      "resolved": "2024-08-29T14:00:00",
      "priority": "P2",
      "category": "Process_Escalation",
      "subcategory": "Underwriting",
      "summary": "Borrower complaint - denial of MNB-2024-08010 disputed",
      "description": "Borrower for loan MNB-2024-08010 contacted branch manager disputing denial. Claims they were told verbally they would be approved. Requesting second review. AUS returned Refer/Caution, DTI at 55.8%, FICO 602.",
      "assigned_to": "R.Thompson",
      "escalated_to": "Maria.Santos",
      "impacted_loans": 1,
      "resolution": "Second review conducted per fair lending policy. Senior Underwriter U.Chen independently reviewed file and concurred with original denial. Credit profile insufficient for manual underwrite approval. Borrower counseled on credit improvement steps and invited to reapply in 12 months. Adverse action notice confirmed delivered.",
      "root_cause": "LO R.Thompson may have provided premature verbal assurance before underwriting review. Coaching documented.",
      "sla_met": true,
      "resolution_hours": 26.5
    },
    {
      "ticket_id": "INC-2024-04567",
      "created": "2024-09-10T14:15:00",
      "resolved": "2024-09-12T10:30:00",
      "priority": "P2",
      "category": "Vendor_Issue",
      "subcategory": "Appraisal",
      "summary": "ValuTrac AMC portal not assigning appraisals within SLA",
      "description": "3 appraisal orders submitted 9/5 still unassigned. ValuTrac portal shows 'Pending Assignment' for 72+ hours. Normal SLA is 48 hours to assignment. Affecting loans MNB-2024-08011, MNB-2024-08012, and one file outside sample period.",
      "assigned_to": "Processing.Manager",
      "escalated_to": "Vendor.Management",
      "impacted_loans": 3,
      "resolution": "ValuTrac confirmed appraiser shortage in TX Hill Country market. Expanded geographic range for appraiser panel. Two of three orders assigned 9/11; third assigned 9/12. Vendor Management scheduling quarterly review with ValuTrac to address recurring capacity issues.",
      "root_cause": "Insufficient appraiser panel coverage in specific geographic area",
      "sla_met": false,
      "resolution_hours": 44.3
    },
    {
      "ticket_id": "INC-2024-04891",
      "created": "2024-10-02T08:45:00",
      "resolved": "2024-10-02T12:30:00",
      "priority": "P1",
      "category": "Compliance_Alert",
      "subcategory": "OFAC",
      "summary": "OFAC potential match on pre-closing screening",
      "description": "Automated OFAC screening at pre-closing milestone flagged potential SDN match for seller on MNB-2024-08022 property transaction. Processing halted per BSA procedures. BSA Officer notified.",
      "assigned_to": "BSA.Officer.Keller",
      "escalated_to": null,
      "impacted_loans": 1,
      "resolution": "BSA Officer reviewed within 2 hours per procedure. Determined FALSE POSITIVE - seller name is common and does not match SDN entry on date of birth or address. Screening disposition documented. Processing resumed. No SAR required.",
      "root_cause": "Common name match against SDN list; system working as designed",
      "sla_met": true,
      "resolution_hours": 3.8
    },
    {
      "ticket_id": "INC-2024-05102",
      "created": "2024-10-15T16:00:00",
      "resolved": "2024-10-22T09:00:00",
      "priority": "P2",
      "category": "Process_Escalation",
      "subcategory": "Processing",
      "summary": "Rate lock expiration - multiple files at risk",
      "description": "5 files with rate locks expiring within 7 days identified during daily pipeline review. Root cause appears to be processing delays from Q3 volume surge. Secondary marketing requesting extension justification for each file.",
      "assigned_to": "James.Whitfield",
      "escalated_to": "Robert.Thornton",
      "impacted_loans": 5,
      "resolution": "Extensions granted for 4 of 5 files at 0.125% fee (waived for 2 files where delay was Bank-caused). Fifth file (MNB-2024-08017) withdrawn by borrower before extension could be processed. Processing Manager implemented daily lock expiration dashboard to prevent recurrence.",
      "root_cause": "Volume surge exceeded processing capacity; no automated lock expiration warning system",
      "sla_met": true,
      "resolution_hours": 137.0
    },
    {
      "ticket_id": "INC-2024-05234",
      "created": "2024-10-28T10:00:00",
      "resolved": "2024-11-05T14:30:00",
      "priority": "P2",
      "category": "Vendor_Issue",
      "subcategory": "Title",
      "summary": "Title company delayed commitment on FL property",
      "description": "Title commitment for MNB-2024-08030 (FL cash-out refi) delayed 2 weeks. Title company citing backlog from hurricane-related filing delays at county recorder. Lock expiring 12/8.",
      "assigned_to": "P.Davis",
      "escalated_to": "Processing.Manager",
      "impacted_loans": 1,
      "resolution": "Switched to backup title company on preferred vendor list. New commitment received within 5 business days. File proceeded to underwriting and closed on time. Vendor Management notified of primary vendor service issues in FL market.",
      "root_cause": "Natural disaster backlog at county level affecting title company operations",
      "sla_met": true,
      "resolution_hours": 172.5
    },
    {
      "ticket_id": "INC-2024-05389",
      "created": "2024-11-08T09:00:00",
      "resolved": null,
      "priority": "P2",
      "category": "Process_Escalation",
      "subcategory": "Underwriting",
      "summary": "Inconsistent self-employed income calculation methods across underwriters",
      "description": "QC review of MNB-2024-08007 identified that underwriter used non-standard addback methodology for self-employed income. Upon further review, 3 different calculation approaches found across the underwriting team. Maria Santos requesting standardized income worksheet template.",
      "assigned_to": "Maria.Santos",
      "escalated_to": "Angela.Torres",
      "impacted_loans": null,
      "resolution": null,
      "root_cause": "SOP does not provide detailed step-by-step calculation for complex SE scenarios; underwriters using different interpretation of guidelines plus informal job aids",
      "sla_met": null,
      "resolution_hours": null
    },
    {
      "ticket_id": "INC-2024-05412",
      "created": "2024-11-12T13:45:00",
      "resolved": "2024-11-13T10:00:00",
      "priority": "P2",
      "category": "Compliance_Alert",
      "subcategory": "TRID",
      "summary": "CD delivered 2 business days before closing instead of required 3",
      "description": "File MNB-2024-08027 had CD delivered on Wednesday 11/27 for Friday 11/29 closing. Thanksgiving Thursday is not a business day. CD should have been delivered Tuesday 11/26 to meet 3-business-day requirement.",
      "assigned_to": "Compliance.Analyst",
      "escalated_to": "Patricia.Nguyen",
      "impacted_loans": 1,
      "resolution": "Closing postponed to Monday 12/2 to comply with waiting period. Borrower notified; seller accommodated. Root cause was Closer miscounting business days around holiday. Compliance training on holiday business day counting scheduled for all Closers.",
      "root_cause": "Human error in business day counting around Thanksgiving holiday",
      "sla_met": true,
      "resolution_hours": 20.3
    },
    {
      "ticket_id": "INC-2025-00187",
      "created": "2025-01-15T11:00:00",
      "resolved": "2025-01-22T16:00:00",
      "priority": "P2",
      "category": "Process_Escalation",
      "subcategory": "Quality_Control",
      "summary": "QC reviews exceeding 90-day SLA for 4 funded loans",
      "description": "Monthly QC status report shows 4 loans funded in September 2024 have not received post-close QC review within 90-day requirement. QC analyst staffing was reduced in Q4 due to analyst departure.",
      "assigned_to": "QC.Manager",
      "escalated_to": "Angela.Torres",
      "impacted_loans": 4,
      "resolution": "Backlogged reviews completed by 1/22. Temporary QC contractor approved for Q1 2025 to address staffing gap. QC Manager implementing priority queue for exception and EPD loans to ensure these are never delayed.",
      "root_cause": "Staff departure created QC capacity shortage; no backup coverage plan",
      "sla_met": false,
      "resolution_hours": 173.0
    },
    {
      "ticket_id": "INC-2025-00342",
      "created": "2025-02-20T14:30:00",
      "resolved": "2025-02-21T09:15:00",
      "priority": "P1",
      "category": "Security_Incident",
      "subcategory": "Wire_Fraud",
      "summary": "Suspected wire fraud attempt on closing funds",
      "description": "Title company for a loan outside the sample period received spoofed email appearing to be from Meridian with modified wire instructions. Title company's callback verification procedure caught the discrepancy before any funds were transferred. BSA Officer notified.",
      "assigned_to": "BSA.Officer.Keller",
      "escalated_to": "IT.Security",
      "impacted_loans": 1,
      "resolution": "Email headers analyzed - originated from external spoofed domain. IT Security blocked domain and alerted staff. Title company confirmed no funds disbursed. BSA Officer filed SAR. All closing coordinators reminded of mandatory verbal callback procedure for wire verification. Enterprise-wide phishing alert issued.",
      "root_cause": "External business email compromise (BEC) attempt targeting closing wire instructions",
      "sla_met": true,
      "resolution_hours": 18.8
    },
    {
      "ticket_id": "INC-2025-00891",
      "created": "2025-05-12T10:00:00",
      "resolved": "2025-05-19T14:00:00",
      "priority": "P2",
      "category": "Process_Escalation",
      "subcategory": "Processing",
      "summary": "Processor using unauthorized document tracking spreadsheet",
      "description": "During monthly controls testing, discovered processors maintaining a shared Excel spreadsheet on desktop to track stale documents instead of using Encompass milestone tracking. Sheet contains borrower loan IDs and document status but no PII. Concern is that this shadow tracking system may lead to inconsistent status reporting.",
      "assigned_to": "James.Whitfield",
      "escalated_to": "Patricia.Nguyen",
      "impacted_loans": null,
      "resolution": "Spreadsheet reviewed - no PII or sensitive data found. Processors explained that Encompass does not have automated stale document alerts, necessitating manual tracking. IT requested to prioritize Encompass configuration for automated alerts. In interim, spreadsheet moved to secure SharePoint with access restricted to processing team. Compliance cleared as low risk.",
      "root_cause": "Gap in LOS system functionality forcing manual workaround; IT enhancement request pending since Q1 2024",
      "sla_met": true,
      "resolution_hours": 172.0
    },
    {
      "ticket_id": "INC-2025-01456",
      "created": "2025-08-05T08:30:00",
      "resolved": "2025-08-12T11:00:00",
      "priority": "P2",
      "category": "Vendor_Issue",
      "subcategory": "Credit",
      "summary": "Credit vendor returning incomplete tri-merge reports",
      "description": "MeridianCredit (credit vendor) intermittently returning bi-merge reports instead of tri-merge for 8 borrowers over past 2 weeks. Missing bureau varies. Underwriters catching issue during review but causes rework and delays.",
      "assigned_to": "Vendor.Management",
      "escalated_to": null,
      "impacted_loans": 8,
      "resolution": "MeridianCredit identified API configuration issue after their August platform upgrade. Patch deployed 8/10. All affected reports re-pulled with complete tri-merge data. Vendor credited reprocessing fees. Added tri-merge completeness check to processor intake checklist as interim control.",
      "root_cause": "Vendor platform upgrade introduced API regression affecting bureau connectivity",
      "sla_met": true,
      "resolution_hours": 170.5
    }
  ]
}
